test.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns3:modify xmlns:ns2="http://www.openiam.org/service/types"
                    xmlns:ns3="http://www.openiam.org/service/connector">
            <reqType>
                <requestID>Rf0193d85e2be4b3b93e6c1a79d541037</requestID>
                <targetID>8a70a63f40adc0f50140b1634f970033</targetID>
                <hostUrl>LDAP://23.21.229.176</hostUrl>
                <hostLoginId>AD\Administrator</hostLoginId>
                <hostLoginPassword>=tdWk2eqV8P</hostLoginPassword>
                <baseDN>ou=idm-test,dc=ad,dc=openiamdemo,dc=info</baseDN>
                <scriptHandler>ADPowershell.ps1</scriptHandler>
                <operation>EDIT</operation>
                <extensibleObject>
                    <ns2:operation>0</ns2:operation>
                    <ns2:attributes>
                        <ns2:name>SamAccountName</ns2:name>
                        <ns2:value>VGVzdEFkVlkyLlRlc3RBZFZZMg==</ns2:value>
                        <ns2:operation>1</ns2:operation>
                        <ns2:multivalued>false</ns2:multivalued>
                        <ns2:dataType>STRING</ns2:dataType>
                        <ns2:objectType>USER</ns2:objectType>
                    </ns2:attributes>
                    <ns2:attributes>
                        <ns2:name>Surname</ns2:name>
                        <ns2:value>VGVzdEFkVlky</ns2:value>
                        <ns2:operation>1</ns2:operation>
                        <ns2:multivalued>false</ns2:multivalued>
                        <ns2:dataType>STRING</ns2:dataType>
                        <ns2:objectType>USER</ns2:objectType>
                    </ns2:attributes>
                    <ns2:attributes>
                        <ns2:name>GivenName</ns2:name>
                        <ns2:value>VGVzdEFkVlky</ns2:value>
                        <ns2:operation>1</ns2:operation>
                        <ns2:multivalued>false</ns2:multivalued>
                        <ns2:dataType>STRING</ns2:dataType>
                        <ns2:objectType>USER</ns2:objectType>
                    </ns2:attributes>
                    <ns2:attributes>
                        <ns2:name>DisplayName</ns2:name>
                        <ns2:value>VGVzdEFkVlkyLFRlc3RBZFZZMg==</ns2:value>
                        <ns2:operation>1</ns2:operation>
                        <ns2:multivalued>false</ns2:multivalued>
                        <ns2:dataType>STRING</ns2:dataType>
                        <ns2:objectType>USER</ns2:objectType>
                    </ns2:attributes>
                    <ns2:attributes>
                        <ns2:name>HomeDirectory</ns2:name>
                        <ns2:value>XFxkZXZzZXJ2ZXJcU1lTVk9MXGlkbWRldi5sb2NhbA==</ns2:value>
                        <ns2:operation>1</ns2:operation>
                        <ns2:multivalued>false</ns2:multivalued>
                        <ns2:dataType>STRING</ns2:dataType>
                        <ns2:objectType>USER</ns2:objectType>
                    </ns2:attributes>
                    <ns2:attributes>
                        <ns2:name>Path</ns2:name>
                        <ns2:value>b3U9aWRtLXRlc3QsZGM9YWQsZGM9b3BlbmlhbWRlbW8sZGM9aW5mbw==</ns2:value>
                        <ns2:operation>1</ns2:operation>
                        <ns2:multivalued>false</ns2:multivalued>
                        <ns2:dataType>STRING</ns2:dataType>
                        <ns2:objectType>USER</ns2:objectType>
                    </ns2:attributes>
                    <ns2:attributes>
                        <ns2:name>HomeDrive</ns2:name>
                        <ns2:value>SDo=</ns2:value>
                        <ns2:operation>1</ns2:operation>
                        <ns2:multivalued>false</ns2:multivalued>
                        <ns2:dataType>STRING</ns2:dataType>
                        <ns2:objectType>USER</ns2:objectType>
                    </ns2:attributes>
                    <ns2:attributes>
                        <ns2:name>ScriptPath</ns2:name>
                        <ns2:value>bmV0eHAuY21k</ns2:value>
                        <ns2:operation>1</ns2:operation>
                        <ns2:multivalued>false</ns2:multivalued>
                        <ns2:dataType>STRING</ns2:dataType>
                        <ns2:objectType>USER</ns2:objectType>
                    </ns2:attributes>
                    <ns2:attributes>
                        <ns2:name>UserPrincipalName</ns2:name>
                        <ns2:value>VGVzdEFkVlkyLlRlc3RBZFZZMkBhZC5vcGVuaWFtZGVtby5pbmZv</ns2:value>
                        <ns2:operation>1</ns2:operation>
                        <ns2:multivalued>false</ns2:multivalued>
                        <ns2:dataType>STRING</ns2:dataType>
                        <ns2:objectType>USER</ns2:objectType>
                    </ns2:attributes>
                    <ns2:attributes>
                        <ns2:name>Name</ns2:name>
                        <ns2:value>VGVzdEFkVlky</ns2:value>
                        <ns2:operation>1</ns2:operation>
                        <ns2:multivalued>false</ns2:multivalued>
                        <ns2:dataType>STRING</ns2:dataType>
                        <ns2:objectType>USER</ns2:objectType>
                    </ns2:attributes>
                    <ns2:attributes>
                        <ns2:name>AccountPassword</ns2:name>
                        <ns2:value>UGFzc3dvcmQkMTIz</ns2:value>
                        <ns2:operation>1</ns2:operation>
                        <ns2:multivalued>false</ns2:multivalued>
                        <ns2:dataType>STRING</ns2:dataType>
                        <ns2:objectType>USER</ns2:objectType>
                    </ns2:attributes>
                    <ns2:attributes>
                        <ns2:name>Enabled</ns2:name>
                        <ns2:value>RmFsc2U=</ns2:value>
                        <ns2:operation>1</ns2:operation>
                        <ns2:multivalued>false</ns2:multivalued>
                        <ns2:dataType>STRING</ns2:dataType>
                        <ns2:objectType>USER</ns2:objectType>
                    </ns2:attributes>
                    <ns2:attributes>
                        <ns2:name>Group</ns2:name>
                        <ns2:operation>1</ns2:operation>
                        <ns2:multivalued>false</ns2:multivalued>
                        <ns2:dataType>STRING</ns2:dataType>
                        <ns2:objectType>USER</ns2:objectType>
                        <ns2:attributeContainer>
                            <attributeList>
                                <selected>false</selected>
                                <name>cn=sdf,OU=idm-test,DC=ad,DC=openiamdemo,DC=info</name>
                                <value>Y249c2RmLE9VPWlkbS10ZXN0LERDPWFkLERDPW9wZW5pYW1kZW1vLERDPWluZm8=</value>
                                <operationEnum>nochange</operationEnum>
                            </attributeList>
                        </ns2:attributeContainer>
                    </ns2:attributes>
                    <ns2:principalFieldName>SamAccountName</ns2:principalFieldName>
                    <ns2:principalFieldDataType>STRING</ns2:principalFieldDataType>
                    <ns2:extensibleObjectType>USER</ns2:extensibleObjectType>
                </extensibleObject>
                <objectIdentity>TestAdVY2.TestAdVY2</objectIdentity>
            </reqType>
        </ns3:modify>
    </soap:Body>
</soap:Envelope>